## Plan Result (prod_general - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 9 to add, 41 to change, 9 to destroy.</code></pre>

* Update
  * azurerm_application_gateway.ag
  * azurerm_key_vault.atlassian_kv
  * azurerm_lb.azlb
  * azurerm_managed_disk.data_disk[&#34;atlassianprodconfluence02-datadisk-000-20250228-221025&#34;]
  * azurerm_managed_disk.data_disk[&#34;atlassianprodconfluence04-datadisk-000-20250228-221041&#34;]
  * azurerm_managed_disk.data_disk[&#34;atlassianprodgluster01-datadisk-000-20250228-221117&#34;]
  * azurerm_managed_disk.data_disk[&#34;atlassianprodgluster01-datadisk-001-20250228-221117&#34;]
  * azurerm_managed_disk.data_disk[&#34;atlassianprodgluster02-datadisk-000-20250228-221141&#34;]
  * azurerm_managed_disk.data_disk[&#34;atlassianprodgluster03-datadisk-000-20250228-221204&#34;]
  * azurerm_managed_disk.data_disk[&#34;atlassianprodjira01-datadisk-000-20250228-220516&#34;]
  * azurerm_network_interface.nic[&#34;atlassian-prod-confluence-02-nic-c76f35248e73463ba673913dbd6e2a56&#34;]
  * azurerm_network_interface.nic[&#34;atlassian-prod-confluence-04-nic-fe70ffff677e4b70b231293c054a5914&#34;]
  * azurerm_network_interface.nic[&#34;atlassian-prod-crowd-01-nic-b4d13bce7fa44641a6a44c8f191ddc25&#34;]
  * azurerm_network_interface.nic[&#34;atlassian-prod-gluster-01-nic-1c8cb6fa1a7a488db7cb7a70c181164f&#34;]
  * azurerm_network_interface.nic[&#34;atlassian-prod-gluster-02-nic-cd44e7ead6654137a23f3daefc5f00f6&#34;]
  * azurerm_network_interface.nic[&#34;atlassian-prod-gluster-03-nic-33273cfe1f254cc5819f2639fc68cc3d&#34;]
  * azurerm_network_interface.nic[&#34;atlassian-prod-jira-01-nic-0fad0fe6e8d94210be9488435aa28b09&#34;]
  * azurerm_network_interface.nic[&#34;atlassian-prod-jira-02-nic-b0cfdcf4e4de498ea2a5bc53c79cfeed&#34;]
  * azurerm_network_interface.nic[&#34;atlassian-prod-jira-03-nic-4b4dcb7535b74ab79a40c21ae805c7d0&#34;]
  * azurerm_postgresql_flexible_server.atlassian-flex-server
  * azurerm_public_ip.app_gw
  * azurerm_recovery_services_vault.rsv
  * azurerm_resource_group.atlassian_rg
  * azurerm_storage_account.this
  * azurerm_user_assigned_identity.identity
  * azurerm_virtual_machine.vm[&#34;atlassian-prod-confluence-02&#34;]
  * azurerm_virtual_machine.vm[&#34;atlassian-prod-confluence-04&#34;]
  * azurerm_virtual_machine.vm[&#34;atlassian-prod-crowd-01&#34;]
  * azurerm_virtual_machine.vm[&#34;atlassian-prod-gluster-01&#34;]
  * azurerm_virtual_machine.vm[&#34;atlassian-prod-gluster-02&#34;]
  * azurerm_virtual_machine.vm[&#34;atlassian-prod-gluster-03&#34;]
  * azurerm_virtual_machine.vm[&#34;atlassian-prod-jira-01&#34;]
  * azurerm_virtual_machine.vm[&#34;atlassian-prod-jira-02&#34;]
  * azurerm_virtual_machine.vm[&#34;atlassian-prod-jira-03&#34;]
  * azurerm_web_application_firewall_policy.waf_policy
  * module.networking.azurerm_network_security_group.this[&#34;atlassian-dmz-subnet-nsg&#34;]
  * module.networking.azurerm_network_security_group.this[&#34;atlassian-int-subnet-app-nsg&#34;]
  * module.networking.azurerm_network_security_group.this[&#34;atlassian-int-subnet-dat-nsg&#34;]
  * module.networking.azurerm_network_security_group.this[&#34;atlassian-int-subnet-ops-nsg&#34;]
  * module.networking.azurerm_virtual_network.this[&#34;atlassian-dmz-prod-vnet&#34;]
  * module.networking.azurerm_virtual_network.this[&#34;atlassian-int-prod-vnet&#34;]
* Replace
  * terraform_data.vm[&#34;atlassian-prod-confluence-02&#34;]
  * terraform_data.vm[&#34;atlassian-prod-confluence-04&#34;]
  * terraform_data.vm[&#34;atlassian-prod-crowd-01&#34;]
  * terraform_data.vm[&#34;atlassian-prod-gluster-01&#34;]
  * terraform_data.vm[&#34;atlassian-prod-gluster-02&#34;]
  * terraform_data.vm[&#34;atlassian-prod-gluster-03&#34;]
  * terraform_data.vm[&#34;atlassian-prod-jira-01&#34;]
  * terraform_data.vm[&#34;atlassian-prod-jira-02&#34;]
  * terraform_data.vm[&#34;atlassian-prod-jira-03&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_key_vault_secret.POSTGRES-FLEX-SERVER-PASS will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-FLEX-SERVER-PASS" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
      + name                    = "prod-POSTGRES-FLEX-SERVER-PASS"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-FLEX-SERVER-USER will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-FLEX-SERVER-USER" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
      + name                    = "prod-POSTGRES-FLEX-SERVER-USER"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-SINGLE-SERVER-PASS will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-SINGLE-SERVER-PASS" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
      + name                    = "prod-POSTGRES-SINGLE-SERVER-PASS"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-SINGLE-SERVER-USER will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-SINGLE-SERVER-USER" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
      + name                    = "prod-POSTGRES-SINGLE-SERVER-USER"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.admin_private_key will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "admin_private_key" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
      + name                    = "test-private-key"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.admin_username will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "admin_username" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
      + name                    = "vm-admin-username"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # azurerm_application_gateway.ag will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway"
        name                              = "atlassian-prod-app-gateway"
      ~ tags                              = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (8 unchanged attributes hidden)

      - probe {
          - id                                        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway/probes/appgw-probe-cnf" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-cnf" -> null
          - path                                      = "/confluence" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway/probes/appgw-probe-crd" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-crd" -> null
          - path                                      = "/crowd" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway/probes/appgw-probe-jira" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-jira" -> null
          - path                                      = "/jira/status" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-cnf"
          + path                                      = "/confluence"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-crd"
          + path                                      = "/crowd"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-jira"
          + path                                      = "/jira/status"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }

      - request_routing_rule {
          - http_listener_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway/httpListeners/appgw-http-listener" -> null
          - http_listener_name          = "appgw-http-listener" -> null
          - id                          = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway/requestRoutingRules/appgw-routing-rule" -> null
          - name                        = "appgw-routing-rule" -> null
          - priority                    = 1 -> null
          - rule_type                   = "PathBasedRouting" -> null
          - url_path_map_id             = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway/urlPathMaps/appgw-url-map-path" -> null
          - url_path_map_name           = "appgw-url-map-path" -> null
            # (8 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "appgw-backend-pool-cnf"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "appgw-backend-settings-cnf"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "appgw-http-listener"
          + id                          = (known after apply)
          + name                        = "appgw-routing-rule"
          + priority                    = 1
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "PathBasedRouting"
          + url_path_map_id             = (known after apply)
          + url_path_map_name           = "appgw-url-map-path"
            # (2 unchanged attributes hidden)
        }

        # (18 unchanged blocks hidden)
    }

  # azurerm_key_vault.atlassian_kv will be updated in-place
  ~ resource "azurerm_key_vault" "atlassian_kv" {
      ~ access_policy                   = [
            {
                application_id          = null
                certificate_permissions = []
                key_permissions         = []
                object_id               = "d309fbf5-9c92-470f-a11a-f307cf73fd00"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Purge",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          + {
              + certificate_permissions = []
              + key_permissions         = []
              + object_id               = "d309fbf5-9c92-470f-a11a-f307cf73fd00"
              + secret_permissions      = [
                  + "Get",
                  + "List",
                  + "Set",
                  + "Delete",
                  + "Purge",
                ]
              + storage_permissions     = []
              + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
                # (1 unchanged attribute hidden)
            },
            {
                application_id          = null
                certificate_permissions = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "ManageContacts",
                    "ManageIssuers",
                    "GetIssuers",
                    "ListIssuers",
                    "SetIssuers",
                    "DeleteIssuers",
                ]
                key_permissions         = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "GetRotationPolicy",
                    "SetRotationPolicy",
                    "Rotate",
                ]
                object_id               = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Purge",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            # (2 unchanged elements hidden)
        ]
        id                              = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
        name                            = "atlasssian-prod-kv"
      ~ tags                            = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_lb.azlb will be updated in-place
  ~ resource "azurerm_lb" "azlb" {
        id                   = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/loadBalancers/atlassian-prod-lb-glusterfs"
        name                 = "atlassian-prod-lb-glusterfs"
      ~ tags                 = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_managed_disk.data_disk["atlassianprodconfluence02-datadisk-000-20250228-221025"] will be updated in-place
  ~ resource "azurerm_managed_disk" "data_disk" {
        id                                = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/disks/atlassianprodconfluence02-datadisk-000-20250228-221025"
        name                              = "atlassianprodconfluence02-datadisk-000-20250228-221025"
      ~ tags                              = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (31 unchanged attributes hidden)
    }

  # azurerm_managed_disk.data_disk["atlassianprodconfluence04-datadisk-000-20250228-221041"] will be updated in-place
  ~ resource "azurerm_managed_disk" "data_disk" {
        id                                = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/disks/atlassianprodconfluence04-datadisk-000-20250228-221041"
        name                              = "atlassianprodconfluence04-datadisk-000-20250228-221041"
      ~ tags                              = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (31 unchanged attributes hidden)
    }

  # azurerm_managed_disk.data_disk["atlassianprodgluster01-datadisk-000-20250228-221117"] will be updated in-place
  ~ resource "azurerm_managed_disk" "data_disk" {
        id                                = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/disks/atlassianprodgluster01-datadisk-000-20250228-221117"
        name                              = "atlassianprodgluster01-datadisk-000-20250228-221117"
      ~ tags                              = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (31 unchanged attributes hidden)
    }

  # azurerm_managed_disk.data_disk["atlassianprodgluster01-datadisk-001-20250228-221117"] will be updated in-place
  ~ resource "azurerm_managed_disk" "data_disk" {
        id                                = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/disks/atlassianprodgluster01-datadisk-001-20250228-221117"
        name                              = "atlassianprodgluster01-datadisk-001-20250228-221117"
      ~ tags                              = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (31 unchanged attributes hidden)
    }

  # azurerm_managed_disk.data_disk["atlassianprodgluster02-datadisk-000-20250228-221141"] will be updated in-place
  ~ resource "azurerm_managed_disk" "data_disk" {
        id                                = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/disks/atlassianprodgluster02-datadisk-000-20250228-221141"
        name                              = "atlassianprodgluster02-datadisk-000-20250228-221141"
      ~ tags                              = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (31 unchanged attributes hidden)
    }

  # azurerm_managed_disk.data_disk["atlassianprodgluster03-datadisk-000-20250228-221204"] will be updated in-place
  ~ resource "azurerm_managed_disk" "data_disk" {
        id                                = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/disks/atlassianprodgluster03-datadisk-000-20250228-221204"
        name                              = "atlassianprodgluster03-datadisk-000-20250228-221204"
      ~ tags                              = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (31 unchanged attributes hidden)
    }

  # azurerm_managed_disk.data_disk["atlassianprodjira01-datadisk-000-20250228-220516"] will be updated in-place
  ~ resource "azurerm_managed_disk" "data_disk" {
        id                                = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/disks/atlassianprodjira01-datadisk-000-20250228-220516"
        name                              = "atlassianprodjira01-datadisk-000-20250228-220516"
      ~ tags                              = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (31 unchanged attributes hidden)
    }

  # azurerm_network_interface.nic["atlassian-prod-confluence-02-nic-c76f35248e73463ba673913dbd6e2a56"] will be updated in-place
  ~ resource "azurerm_network_interface" "nic" {
        id                             = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/networkInterfaces/atlassian-prod-confluence-02-nic-c76f35248e73463ba673913dbd6e2a56"
        name                           = "atlassian-prod-confluence-02-nic-c76f35248e73463ba673913dbd6e2a56"
      ~ tags                           = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_network_interface.nic["atlassian-prod-confluence-04-nic-fe70ffff677e4b70b231293c054a5914"] will be updated in-place
  ~ resource "azurerm_network_interface" "nic" {
        id                             = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/networkInterfaces/atlassian-prod-confluence-04-nic-fe70ffff677e4b70b231293c054a5914"
        name                           = "atlassian-prod-confluence-04-nic-fe70ffff677e4b70b231293c054a5914"
      ~ tags                           = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_network_interface.nic["atlassian-prod-crowd-01-nic-b4d13bce7fa44641a6a44c8f191ddc25"] will be updated in-place
  ~ resource "azurerm_network_interface" "nic" {
        id                             = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/networkInterfaces/atlassian-prod-crowd-01-nic-b4d13bce7fa44641a6a44c8f191ddc25"
        name                           = "atlassian-prod-crowd-01-nic-b4d13bce7fa44641a6a44c8f191ddc25"
      ~ tags                           = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_network_interface.nic["atlassian-prod-gluster-01-nic-1c8cb6fa1a7a488db7cb7a70c181164f"] will be updated in-place
  ~ resource "azurerm_network_interface" "nic" {
        id                             = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/networkInterfaces/atlassian-prod-gluster-01-nic-1c8cb6fa1a7a488db7cb7a70c181164f"
        name                           = "atlassian-prod-gluster-01-nic-1c8cb6fa1a7a488db7cb7a70c181164f"
      ~ tags                           = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_network_interface.nic["atlassian-prod-gluster-02-nic-cd44e7ead6654137a23f3daefc5f00f6"] will be updated in-place
  ~ resource "azurerm_network_interface" "nic" {
        id                             = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/networkInterfaces/atlassian-prod-gluster-02-nic-cd44e7ead6654137a23f3daefc5f00f6"
        name                           = "atlassian-prod-gluster-02-nic-cd44e7ead6654137a23f3daefc5f00f6"
      ~ tags                           = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_network_interface.nic["atlassian-prod-gluster-03-nic-33273cfe1f254cc5819f2639fc68cc3d"] will be updated in-place
  ~ resource "azurerm_network_interface" "nic" {
        id                             = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/networkInterfaces/atlassian-prod-gluster-03-nic-33273cfe1f254cc5819f2639fc68cc3d"
        name                           = "atlassian-prod-gluster-03-nic-33273cfe1f254cc5819f2639fc68cc3d"
      ~ tags                           = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_network_interface.nic["atlassian-prod-jira-01-nic-0fad0fe6e8d94210be9488435aa28b09"] will be updated in-place
  ~ resource "azurerm_network_interface" "nic" {
        id                             = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/networkInterfaces/atlassian-prod-jira-01-nic-0fad0fe6e8d94210be9488435aa28b09"
        name                           = "atlassian-prod-jira-01-nic-0fad0fe6e8d94210be9488435aa28b09"
      ~ tags                           = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_network_interface.nic["atlassian-prod-jira-02-nic-b0cfdcf4e4de498ea2a5bc53c79cfeed"] will be updated in-place
  ~ resource "azurerm_network_interface" "nic" {
        id                             = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/networkInterfaces/atlassian-prod-jira-02-nic-b0cfdcf4e4de498ea2a5bc53c79cfeed"
        name                           = "atlassian-prod-jira-02-nic-b0cfdcf4e4de498ea2a5bc53c79cfeed"
      ~ tags                           = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_network_interface.nic["atlassian-prod-jira-03-nic-4b4dcb7535b74ab79a40c21ae805c7d0"] will be updated in-place
  ~ resource "azurerm_network_interface" "nic" {
        id                             = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/networkInterfaces/atlassian-prod-jira-03-nic-4b4dcb7535b74ab79a40c21ae805c7d0"
        name                           = "atlassian-prod-jira-03-nic-4b4dcb7535b74ab79a40c21ae805c7d0"
      ~ tags                           = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_postgresql_flexible_server.atlassian-flex-server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "atlassian-flex-server" {
      ~ administrator_password            = (sensitive value)
        id                                = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/atlassian-prod-flex-server"
        name                              = "atlassian-prod-flex-server"
      ~ tags                              = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (18 unchanged attributes hidden)

      ~ authentication {
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_public_ip.app_gw will be updated in-place
  ~ resource "azurerm_public_ip" "app_gw" {
        id                      = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/publicIPAddresses/atlassian-prod-public-ip"
        name                    = "atlassian-prod-public-ip"
      ~ tags                    = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (12 unchanged attributes hidden)
    }

  # azurerm_recovery_services_vault.rsv will be updated in-place
  ~ resource "azurerm_recovery_services_vault" "rsv" {
        id                                 = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-prod-rsv"
        name                               = "atlassian-prod-rsv"
      ~ tags                               = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (9 unchanged attributes hidden)
    }

  # azurerm_resource_group.atlassian_rg will be updated in-place
  ~ resource "azurerm_resource_group" "atlassian_rg" {
        id         = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg"
        name       = "atlassian-prod-rg"
      ~ tags       = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
        id                                 = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Storage/storageAccounts/atlassianprod"
        name                               = "atlassianprod"
      ~ tags                               = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (96 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_user_assigned_identity.identity will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "identity" {
        id                  = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/atlassian-prod-app-gateway-identity"
        name                = "atlassian-prod-app-gateway-identity"
      ~ tags                = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # azurerm_virtual_machine.vm["atlassian-prod-confluence-02"] will be updated in-place
  ~ resource "azurerm_virtual_machine" "vm" {
        id                               = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-confluence-02"
        name                             = "atlassian-prod-confluence-02"
      ~ tags                             = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_virtual_machine.vm["atlassian-prod-confluence-04"] will be updated in-place
  ~ resource "azurerm_virtual_machine" "vm" {
        id                               = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-confluence-04"
        name                             = "atlassian-prod-confluence-04"
      ~ tags                             = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_virtual_machine.vm["atlassian-prod-crowd-01"] will be updated in-place
  ~ resource "azurerm_virtual_machine" "vm" {
        id                               = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-crowd-01"
        name                             = "atlassian-prod-crowd-01"
      ~ tags                             = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_virtual_machine.vm["atlassian-prod-gluster-01"] will be updated in-place
  ~ resource "azurerm_virtual_machine" "vm" {
        id                               = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-gluster-01"
        name                             = "atlassian-prod-gluster-01"
      ~ tags                             = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (8 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_virtual_machine.vm["atlassian-prod-gluster-02"] will be updated in-place
  ~ resource "azurerm_virtual_machine" "vm" {
        id                               = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-gluster-02"
        name                             = "atlassian-prod-gluster-02"
      ~ tags                             = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_virtual_machine.vm["atlassian-prod-gluster-03"] will be updated in-place
  ~ resource "azurerm_virtual_machine" "vm" {
        id                               = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-gluster-03"
        name                             = "atlassian-prod-gluster-03"
      ~ tags                             = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_virtual_machine.vm["atlassian-prod-jira-01"] will be updated in-place
  ~ resource "azurerm_virtual_machine" "vm" {
        id                               = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-jira-01"
        name                             = "atlassian-prod-jira-01"
      ~ tags                             = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_virtual_machine.vm["atlassian-prod-jira-02"] will be updated in-place
  ~ resource "azurerm_virtual_machine" "vm" {
        id                               = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-jira-02"
        name                             = "atlassian-prod-jira-02"
      ~ tags                             = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_virtual_machine.vm["atlassian-prod-jira-03"] will be updated in-place
  ~ resource "azurerm_virtual_machine" "vm" {
        id                               = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-jira-03"
        name                             = "atlassian-prod-jira-03"
      ~ tags                             = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_web_application_firewall_policy.waf_policy will be updated in-place
  ~ resource "azurerm_web_application_firewall_policy" "waf_policy" {
        id                  = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/atlassian-prod-app-gateway-waf-policy"
        name                = "atlassian-prod-app-gateway-waf-policy"
      ~ tags                = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (4 unchanged attributes hidden)

        # (10 unchanged blocks hidden)
    }

  # terraform_data.vm["atlassian-prod-confluence-02"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "2f21ab25-e399-5fbd-df13-f53d6eb77993" -> (known after apply)
      ~ triggers_replace = [
          ~ "5006b1fa91d04c54fbe858bc9f50793d" -> "49f9e923029ec3db9878754346a33147",
          ~ "46379146df6d5b281e14fe98b086d64d" -> "9e8656a27b3d084d872ad83d2dd29211",
          ~ "cf9779b276bfff900f5dc2678743d4c0" -> "13c77b0af771597150471f57eaa8e06e",
          ~ "0dc600fb2026a77d83f69d1e2c808614" -> "1ac7e3a8369fb8eec0a410da77dc133f",
          ~ "db3ea414fa35c8f779a892749de8badc" -> "ceb1f2e73cfd06f800f4cd41216d3a7a",
        ]
    }

  # terraform_data.vm["atlassian-prod-confluence-04"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "fa5e0732-dc3d-7d85-18c9-4806b4632935" -> (known after apply)
      ~ triggers_replace = [
          ~ "5006b1fa91d04c54fbe858bc9f50793d" -> "49f9e923029ec3db9878754346a33147",
          ~ "46379146df6d5b281e14fe98b086d64d" -> "9e8656a27b3d084d872ad83d2dd29211",
          ~ "cf9779b276bfff900f5dc2678743d4c0" -> "13c77b0af771597150471f57eaa8e06e",
          ~ "0dc600fb2026a77d83f69d1e2c808614" -> "1ac7e3a8369fb8eec0a410da77dc133f",
          ~ "db3ea414fa35c8f779a892749de8badc" -> "ceb1f2e73cfd06f800f4cd41216d3a7a",
        ]
    }

  # terraform_data.vm["atlassian-prod-crowd-01"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "c341aad0-d7f9-a005-228b-ffbd16aa794c" -> (known after apply)
      ~ triggers_replace = [
          ~ "5006b1fa91d04c54fbe858bc9f50793d" -> "49f9e923029ec3db9878754346a33147",
          ~ "46379146df6d5b281e14fe98b086d64d" -> "9e8656a27b3d084d872ad83d2dd29211",
          ~ "cf9779b276bfff900f5dc2678743d4c0" -> "13c77b0af771597150471f57eaa8e06e",
          ~ "0dc600fb2026a77d83f69d1e2c808614" -> "1ac7e3a8369fb8eec0a410da77dc133f",
          ~ "db3ea414fa35c8f779a892749de8badc" -> "ceb1f2e73cfd06f800f4cd41216d3a7a",
        ]
    }

  # terraform_data.vm["atlassian-prod-gluster-01"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "1650aee0-7ffd-7b98-29a0-6a3b593b087f" -> (known after apply)
      ~ triggers_replace = [
          ~ "5006b1fa91d04c54fbe858bc9f50793d" -> "49f9e923029ec3db9878754346a33147",
          ~ "46379146df6d5b281e14fe98b086d64d" -> "9e8656a27b3d084d872ad83d2dd29211",
          ~ "cf9779b276bfff900f5dc2678743d4c0" -> "13c77b0af771597150471f57eaa8e06e",
          ~ "0dc600fb2026a77d83f69d1e2c808614" -> "1ac7e3a8369fb8eec0a410da77dc133f",
          ~ "db3ea414fa35c8f779a892749de8badc" -> "ceb1f2e73cfd06f800f4cd41216d3a7a",
        ]
    }

  # terraform_data.vm["atlassian-prod-gluster-02"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "43cecb52-9fed-a83b-7ebd-c230f3df3bcf" -> (known after apply)
      ~ triggers_replace = [
          ~ "5006b1fa91d04c54fbe858bc9f50793d" -> "49f9e923029ec3db9878754346a33147",
          ~ "46379146df6d5b281e14fe98b086d64d" -> "9e8656a27b3d084d872ad83d2dd29211",
          ~ "cf9779b276bfff900f5dc2678743d4c0" -> "13c77b0af771597150471f57eaa8e06e",
          ~ "0dc600fb2026a77d83f69d1e2c808614" -> "1ac7e3a8369fb8eec0a410da77dc133f",
          ~ "db3ea414fa35c8f779a892749de8badc" -> "ceb1f2e73cfd06f800f4cd41216d3a7a",
        ]
    }

  # terraform_data.vm["atlassian-prod-gluster-03"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "c2dbc37a-db3e-8195-a1b7-5ffd8c76297b" -> (known after apply)
      ~ triggers_replace = [
          ~ "5006b1fa91d04c54fbe858bc9f50793d" -> "49f9e923029ec3db9878754346a33147",
          ~ "46379146df6d5b281e14fe98b086d64d" -> "9e8656a27b3d084d872ad83d2dd29211",
          ~ "cf9779b276bfff900f5dc2678743d4c0" -> "13c77b0af771597150471f57eaa8e06e",
          ~ "0dc600fb2026a77d83f69d1e2c808614" -> "1ac7e3a8369fb8eec0a410da77dc133f",
          ~ "db3ea414fa35c8f779a892749de8badc" -> "ceb1f2e73cfd06f800f4cd41216d3a7a",
        ]
    }

  # terraform_data.vm["atlassian-prod-jira-01"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "8d8c02a8-845b-d2bf-0901-126352187d2c" -> (known after apply)
      ~ triggers_replace = [
          ~ "5006b1fa91d04c54fbe858bc9f50793d" -> "49f9e923029ec3db9878754346a33147",
          ~ "46379146df6d5b281e14fe98b086d64d" -> "9e8656a27b3d084d872ad83d2dd29211",
          ~ "cf9779b276bfff900f5dc2678743d4c0" -> "13c77b0af771597150471f57eaa8e06e",
          ~ "0dc600fb2026a77d83f69d1e2c808614" -> "1ac7e3a8369fb8eec0a410da77dc133f",
          ~ "db3ea414fa35c8f779a892749de8badc" -> "ceb1f2e73cfd06f800f4cd41216d3a7a",
        ]
    }

  # terraform_data.vm["atlassian-prod-jira-02"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "15b4b445-41c5-cb2a-dea5-1618d708946b" -> (known after apply)
      ~ triggers_replace = [
          ~ "5006b1fa91d04c54fbe858bc9f50793d" -> "49f9e923029ec3db9878754346a33147",
          ~ "46379146df6d5b281e14fe98b086d64d" -> "9e8656a27b3d084d872ad83d2dd29211",
          ~ "cf9779b276bfff900f5dc2678743d4c0" -> "13c77b0af771597150471f57eaa8e06e",
          ~ "0dc600fb2026a77d83f69d1e2c808614" -> "1ac7e3a8369fb8eec0a410da77dc133f",
          ~ "db3ea414fa35c8f779a892749de8badc" -> "ceb1f2e73cfd06f800f4cd41216d3a7a",
        ]
    }

  # terraform_data.vm["atlassian-prod-jira-03"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "fca727b9-a7d9-04ca-00e9-5d680c316be9" -> (known after apply)
      ~ triggers_replace = [
          ~ "5006b1fa91d04c54fbe858bc9f50793d" -> "49f9e923029ec3db9878754346a33147",
          ~ "46379146df6d5b281e14fe98b086d64d" -> "9e8656a27b3d084d872ad83d2dd29211",
          ~ "cf9779b276bfff900f5dc2678743d4c0" -> "13c77b0af771597150471f57eaa8e06e",
          ~ "0dc600fb2026a77d83f69d1e2c808614" -> "1ac7e3a8369fb8eec0a410da77dc133f",
          ~ "db3ea414fa35c8f779a892749de8badc" -> "ceb1f2e73cfd06f800f4cd41216d3a7a",
        ]
    }

  # module.networking.azurerm_network_security_group.this["atlassian-dmz-subnet-nsg"] will be updated in-place
  ~ resource "azurerm_network_security_group" "this" {
        id                  = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/networkSecurityGroups/atlassian-networking-atlassian-dmz-subnet-nsg-prod"
        name                = "atlassian-networking-atlassian-dmz-subnet-nsg-prod"
      ~ tags                = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (3 unchanged attributes hidden)
    }

  # module.networking.azurerm_network_security_group.this["atlassian-int-subnet-app-nsg"] will be updated in-place
  ~ resource "azurerm_network_security_group" "this" {
        id                  = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/networkSecurityGroups/atlassian-networking-atlassian-int-subnet-app-nsg-prod"
        name                = "atlassian-networking-atlassian-int-subnet-app-nsg-prod"
      ~ tags                = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (3 unchanged attributes hidden)
    }

  # module.networking.azurerm_network_security_group.this["atlassian-int-subnet-dat-nsg"] will be updated in-place
  ~ resource "azurerm_network_security_group" "this" {
        id                  = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/networkSecurityGroups/atlassian-networking-atlassian-int-subnet-dat-nsg-prod"
        name                = "atlassian-networking-atlassian-int-subnet-dat-nsg-prod"
      ~ tags                = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (3 unchanged attributes hidden)
    }

  # module.networking.azurerm_network_security_group.this["atlassian-int-subnet-ops-nsg"] will be updated in-place
  ~ resource "azurerm_network_security_group" "this" {
        id                  = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/networkSecurityGroups/atlassian-networking-atlassian-int-subnet-ops-nsg-prod"
        name                = "atlassian-networking-atlassian-int-subnet-ops-nsg-prod"
      ~ tags                = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (3 unchanged attributes hidden)
    }

  # module.networking.azurerm_virtual_network.this["atlassian-dmz-prod-vnet"] will be updated in-place
  ~ resource "azurerm_virtual_network" "this" {
        id                             = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/virtualNetworks/atlassian-dmz-prod-vnet"
        name                           = "atlassian-dmz-prod-vnet"
      ~ tags                           = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (10 unchanged attributes hidden)
    }

  # module.networking.azurerm_virtual_network.this["atlassian-int-prod-vnet"] will be updated in-place
  ~ resource "azurerm_virtual_network" "this" {
        id                             = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/virtualNetworks/atlassian-int-prod-vnet"
        name                           = "atlassian-int-prod-vnet"
      ~ tags                           = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (10 unchanged attributes hidden)
    }

Plan: 9 to add, 41 to change, 9 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":80,"Program":"tfcmt","SHA1":"","Target":"prod_general - TerraformPlanApply","Vars":{}} -->